# Specifications - Database
Specifically, they want the data from the following files included in your database:

- Title Basics:
    - Movie ID (tconst)
    - Primary Title
    - Start Year
    - Runtime (in Minutes)
    - Genres
- Title Ratings
    - Movie ID (tconst)
    - Average Movie Rating
    - Number of Votes
- The TMDB API Results (multiple files)
    - Movie ID
    - Revenue
    - Budget
    - Certification (MPAA Rating)

# Preliminary Steps

In [1]:
# imports
import pandas as pd

In [2]:
title_basics = pd.read_csv('Data/title_basics.csv.gz')
title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama

In [3]:
#create a new col with list of genres
title_basics['genres_split']=title_basics['genres'].str.split(',')

#separate genres_split to different rows
exploded_genres = title_basics.explode('genres_split')
exploded_genres.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama

In [4]:
unique_genres = sorted(exploded_genres['genres_split'].unique())
print(type(unique_genres))
unique_genres

<class 'list'>

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

# Create title_genres dataframe

In [5]:
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

# Create genres dataframe

In [6]:
## Making the genre mapper dictionary
## making a dict to assign each genre (key) with a value
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

# Replace the string genres in title_genres with the new integer ids to become new title_genres col

In [7]:
title_genres['genre_id']=title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

## Create genres table by converting the genre map dictionary into a dataframe

In [8]:
## Manually make df with name col from the key and value
genres=pd.DataFrame({'Genre_Name': genre_map.keys(),
                                                  'Genre_ID': genre_map.values()})
genres.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

### Create title basics table

In [9]:
keepers = ['tconst', 'primaryTitle', 'startYear', 'runtimeMinutes']
title_basics = title_basics[keepers]
title_basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0096056,Crime and Punishment,2002,126

### Create title ratings table

In [10]:
title_ratings = pd.read_csv('Data/title_ratings.csv.gz')
title_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1987
1  tt0000002            5.8       265
2  tt0000005            6.2      2631
3  tt0000006            5.1       182
4  tt0000007            5.4       824

### Create tmdb data table

In [11]:
tmdb_data = pd.read_csv('Data/tmdb_results_combined.csv.gz')
keepers = ['imdb_id','budget', 'revenue', 'certification' ]
tmdb_data = tmdb_data[keepers]
tmdb_data.head()

     imdb_id      budget     revenue certification
0  tt0113026  10000000.0         0.0           NaN
1  tt0113092         0.0         0.0           NaN
2  tt0116391         0.0         0.0           NaN
3  tt0118694    150000.0  14204632.0            PG
4  tt0118852         0.0         0.0             R

# Save SQL tables

In [12]:
# imports
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy.types import *
from sqlalchemy_utils import database_exists
from sqlalchemy_utils import create_database, database_exists

In [13]:
#create connection string
username='root'
password='root'
db_name='movies'
connection=f'mysql+pymysql://{username}:{password}@localhost/{db_name}'
    
#create an engine
engine=create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/movies)

In [14]:
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print("The database created!")

It exists!

# Saving title basics table

In [16]:
## Calculate max string lengths for object columns
key_len = title_basics['tconst'].fillna('').map(len).max()
title_len = title_basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

#save to sql with dtype and ic
title_basics.to_sql('title_basics', engine, dtype=df_schema, if_exists = 'replace', index = False)

engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

# Saving title ratings table

In [17]:
## Calculate max string lengths for object columns
key_len = title_ratings['tconst'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    'averageRating':Float(),
    'numVotes':Float()}

#save to sql with dtype and ic
title_ratings.to_sql('title_ratings', engine, dtype=df_schema, if_exists = 'replace', index = False)

engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

# Saving title genres table

In [18]:
## Calculate max string lengths for object columns
key_len = title_genres['tconst'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    'genre_id':Float()}

#save to sql with dtype and ic
title_genres.to_sql('title_genres', engine, dtype=df_schema, if_exists = 'replace', index = False)

162550

# Saving tmdb table

In [19]:
## Calculate max string lengths for object columns
key_len = tmdb_data['imdb_id'].fillna('').map(len).max()
cert_len = tmdb_data['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "imdb_id": String(key_len+1), 
    "certification": Text(cert_len+1),
    'budget':Float(),
    'revenue':Float()}

#save to sql with dtype and ic
tmdb_data.to_sql('tmdb_data', engine, dtype=df_schema, if_exists = 'replace', 
                    index = False)

2592

# Saving genre table

In [20]:
## Calculate max string lengths for object columns
key_len = genres['Genre_Name'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "Genre_Name": String(key_len+1), 
    'Genre_ID':Float()}

#save to sql with dtype and ic
genres.to_sql('genres', engine, dtype=df_schema, if_exists = 'replace', index = False)

25

In [21]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`Genre_ID`);')

In [22]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

# Display first 5 rows of that table using a SQL query

In [23]:
q = """
SELECT * 
FROM title_basics
LIMIT 5;
"""

pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126

In [24]:
q = """
SELECT * 
FROM title_ratings
LIMIT 5;
"""

pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7    1987.0
1  tt0000002            5.8     265.0
2  tt0000005            6.2    2631.0
3  tt0000006            5.1     182.0
4  tt0000007            5.4     824.0

In [25]:
q = """
SELECT * 
FROM tmdb_data
LIMIT 5;
"""

pd.read_sql(q, engine)

     imdb_id      budget     revenue certification
0  tt0035423  48000000.0  76019000.0         PG-13
1  tt0113026  10000000.0         0.0          None
2  tt0113092         0.0         0.0          None
3  tt0114447         0.0         0.0          None
4  tt0116391         0.0         0.0          None

In [26]:
q = """
SELECT * 
FROM title_genres
LIMIT 5;
"""

pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423       5.0
1  tt0035423       9.0
2  tt0035423      18.0
3  tt0062336       7.0
4  tt0069049       7.0

In [27]:
q = """
SELECT * 
FROM genres
LIMIT 5;
"""

pd.read_sql(q, engine)

  Genre_Name  Genre_ID
0     Action       0.0
1      Adult       1.0
2  Adventure       2.0
3  Animation       3.0
4  Biography       4.0

# Show tables in MySQL

In [28]:
q = """
SHOW TABLES;
"""

pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data